Enums/СпособыВыдачиСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыВыдачиСИЗ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПериодичностью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоИзноса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/СредстваИндивидуальнойЗащитыКлиентСервер/Ext/Module.bsl
// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Представление периодичности.
// 
// Параметры:
//  Кратность - Число - Кратность
//  Периодичность - Число - Периодичность
//  ЕдиницаПериодичности - ПеречислениеСсылка.Периодичность - Единица периодичности
//  ЕдиницаИзмерения - Неопределено, СправочникСсылка.КлассификаторЕдиницИзмерения - Единица измерения
//  Количество - Число - Количество
//  СпособВыдачи - ПеречислениеСсылка.СпособыВыдачиСИЗ
// 
// Возвращаемое значение:
//  Строка - Представление периодичности
Функция ПредставлениеПериодичности(Кратность, Периодичность, ЕдиницаПериодичности,
		ЕдиницаИзмерения = Неопределено, Количество = 0, СпособВыдачи = Неопределено) Экспорт
	
	Если СпособВыдачи = ПредопределенноеЗначение("Перечисление.СпособыВыдачиСИЗ.ДоИзноса") Тогда
		Если ЕдиницаИзмерения = Неопределено Или Количество < 2 Тогда
			Возврат НСтр("ru = 'До износа'");
		Иначе
			Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2 до износа'"),
				Строка(Количество),
				Строка(ЕдиницаИзмерения));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Кратность) Или Не ЗначениеЗаполнено(Периодичность) Тогда
		Возврат "";
	КонецЕсли;
	
	КратностьПредставление = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 раз;;%1 раза;%1 раз;'"), 
		Кратность);
		
	ШаблонЕдиницыПериодичности = "";
	Если ЕдиницаПериодичности = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 год;;%1 года;%1 лет;'");
	ИначеЕсли ЕдиницаПериодичности = ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие") Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 полугодие;;%1 полугодия;%1 полугодий;'");
	ИначеЕсли ЕдиницаПериодичности = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 квартал;;%1 квартала;%1 кварталов;'");
	ИначеЕсли ЕдиницаПериодичности = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		ШаблонЕдиницыПериодичности = НСтр("ru=';%1 месяц;;%1 месяца;%1 месяцев;'");
	КонецЕсли;
	
	Если Периодичность = 1 Тогда
		ШаблонЕдиницыПериодичности = СтрЗаменить(ШаблонЕдиницыПериодичности, "%1", "");
	КонецЕсли;
	
	ПериодичностьПредставление = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		ШаблонЕдиницыПериодичности, 
		Периодичность);
	
	Если ЕдиницаИзмерения = Неопределено Или Количество < 2 Тогда
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 в %2'"),
			КратностьПредставление,
			ПериодичностьПредставление);
	Иначе
		Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 %2 %3 в %4'"),
			Строка(Количество),
			Строка(ЕдиницаИзмерения),
			КратностьПредставление,
			ПериодичностьПредставление);
	КонецЕсли;
	
	Возврат Представление;
		
КонецФункции

// Параметры описания строки СИЗ.
// 
// Возвращаемое значение:
//  Структура - Параметры описания строки СИЗ:
//   * ДополнитьДляСотрудника - Булево
//   * ДополнитьДляВыдачи - Булево
//   * ДополнитьДляПродления - Булево
//   * ДополнитьДляСписания - Булево
//   * ДополнитьДляВводаОстатков - Булево
Функция ПараметрыОписанияСтрокиСИЗ() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДополнитьДляСотрудника", Ложь);
	Параметры.Вставить("ДополнитьДляВыдачи", Ложь);
	Параметры.Вставить("ДополнитьДляПродления", Ложь);
	Параметры.Вставить("ДополнитьДляСписания", Ложь);
	Параметры.Вставить("ДополнитьДляВводаОстатков", Ложь);
	
	Возврат Параметры;
	
КонецФункции

// Описание строки СИЗ.
// 
// Параметры:
//  ПараметрыОписания - См. ПараметрыОписанияСтрокиСИЗ
// 
// Возвращаемое значение:
//  Структура - Описание строки СИЗ:
// * ТипНоменклатуры - ПеречислениеСсылка.ТипыНоменклатуры
// * РабочееМесто - СправочникСсылка.РабочиеМестаОхраныТруда
// * СИЗ - СправочникСсылка.СредстваИндивидуальнойЗащиты
// * Количество - Число
// * СпособВыдачи - ПеречислениеСсылка.СпособыВыдачиСИЗ
// * Дежурное - Булево
// * ЕдиницаИзмерения - СправочникСсылка.КлассификаторЕдиницИзмерения
// * КратностьВыдачи - Число
// * ПериодичностьВыдачи - Число
// * ЕдиницаПериодичностиВыдачи - ПеречислениеСсылка.Периодичность
// * ДатаСледующейВыдачи - Дата
// * Размер - СправочникСсылка.Размеры
// * ПоследняяВыдача - Дата
// * РезультатВыдачи - ПеречислениеСсылка.РезультатыВыдачиСИЗ
// * Номенклатура - СправочникСсылка.Номенклатура
// * ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры
// * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикиНоменклатуры
// * ОснованиеВыдачи - ДокументСсылка.ЗаказНаВыдачуСИЗ
// * ДействиеСРанееВыданнымСИЗ - ПеречислениеСсылка.ДействияСИстекающимиСИЗ
// * ДокументВыдачи - ДокументСсылка.ВыдачаСИЗ
//
Функция ОписаниеСтрокиСИЗ(ПараметрыОписания) Экспорт
	
	ПоляОписания = Новый Соответствие;
	ПоляОписания.Вставить("ТипНоменклатуры", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"));
	ПоляОписания.Вставить("РабочееМесто", Новый ОписаниеТипов("СправочникСсылка.РабочиеМестаОхраныТруда"));
	ПоляОписания.Вставить("СИЗ", Новый ОписаниеТипов("СправочникСсылка.СредстваИндивидуальнойЗащиты"));
	ПоляОписания.Вставить("Количество", Новый ОписаниеТипов("Число"));
	ПоляОписания.Вставить("СпособВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыВыдачиСИЗ"));
	ПоляОписания.Вставить("Дежурное", Новый ОписаниеТипов("Булево"));
	ПоляОписания.Вставить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ПоляОписания.Вставить("КратностьВыдачи", Новый ОписаниеТипов("Число"));
	ПоляОписания.Вставить("ПериодичностьВыдачи", Новый ОписаниеТипов("Число"));
	ПоляОписания.Вставить("ЕдиницаПериодичностиВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.Периодичность"));
	ПоляОписания.Вставить("ДатаСледующейВыдачи", Новый ОписаниеТипов("Дата"));
	
	Если ПараметрыОписания.ДополнитьДляСотрудника Тогда
		ПоляОписания.Вставить("Размер", Новый ОписаниеТипов("СправочникСсылка.Размеры"));
		Если Не ПараметрыОписания.ДополнитьДляВводаОстатков Тогда
			ПоляОписания.Вставить("ПоследняяВыдача", Новый ОписаниеТипов("Дата"));
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляВыдачи Тогда
		ПоляОписания.Вставить("РезультатВыдачи", Новый ОписаниеТипов("ПеречислениеСсылка.РезультатыВыдачиСИЗ"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляВыдачи Или ПараметрыОписания.ДополнитьДляПродления
	 Или ПараметрыОписания.ДополнитьДляСписания Или ПараметрыОписания.ДополнитьДляВводаОстатков Тогда
		ПоляОписания.Вставить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ПоляОписания.Вставить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
		ПоляОписания.Вставить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляВыдачи Или ПараметрыОписания.ДополнитьДляПродления
	 Или ПараметрыОписания.ДополнитьДляСписания Тогда
		ПоляОписания.Вставить("ОснованиеВыдачи",
			Новый ОписаниеТипов("ДокументСсылка.ЗаказНаВыдачуСИЗ, ДокументСсылка.ВводНачальныхОстатковВыданныхСИЗ"));
		ПоляОписания.Вставить("ДействиеСРанееВыданнымСИЗ", Новый ОписаниеТипов("ПеречислениеСсылка.ДействияСИстекающимиСИЗ"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляСписания Или ПараметрыОписания.ДополнитьДляПродления Тогда
		ПоляОписания.Вставить("ДокументВыдачи",
			Новый ОписаниеТипов("ДокументСсылка.ВыдачаСИЗ, ДокументСсылка.ВводНачальныхОстатковВыданныхСИЗ"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляПродления Тогда
		ПоляОписания.Вставить("ПроцентИзноса", Новый ОписаниеТипов("Число"));
		ПоляОписания.Вставить("Продлить", Новый ОписаниеТипов("Булево"));
		ПоляОписания.Вставить("Заключение", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляСписания Тогда
		ПоляОписания.Вставить("ПричинаСписания", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	Если ПараметрыОписания.ДополнитьДляВводаОстатков Тогда
		ПоляОписания.Вставить("ДатаВыдачи", Новый ОписаниеТипов("Дата"));
	КонецЕсли;
	
	Описание = Новый Структура;
	Для Каждого КлючИЗначение Из ПоляОписания Цикл
		Описание.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.ПривестиЗначение());
	КонецЦикла;
	
	Возврат Описание; //@skip-check constructor-function-return-section
	
КонецФункции

// Имена навигационных ссылок состояний выдачи сотрудникам.
// 
// Возвращаемое значение:
//  Структура - Имена навигационных ссылок состояний выдачи сотрудникам:
// * ОжидаютВыдачи - Строка -
// * Выдано - Строка -
Функция ИменаНавигационныхСсылокСостоянийВыдачиСотрудникам() Экспорт
	
	СостоянияВыдачи = Новый Структура;
	СостоянияВыдачи.Вставить("ОжидаютВыдачи", "СотрудникиСИЗОжидаютВыдачи");
	СостоянияВыдачи.Вставить("Выдано", "СотрудникиСИЗВыдано");
	
	Возврат СостоянияВыдачи;
	
КонецФункции

#КонецОбласти
